maksidze/SmartESC_STM32_M365/Core/Src/util.c
#if KX
  #if !defined(VARIANT_HOVERBOARD) && !defined(VARIANT_TRANSPOTTER)
    uint16_t writeCheck, i_max, n_max;
    HAL_FLASH_Unlock();
    EE_Init();            /* EEPROM Init */
    EE_ReadVariable(VirtAddVarTab[0], &writeCheck);
    if (writeCheck == FLASH_WRITE_KEY) {
      EE_ReadVariable(VirtAddVarTab[1] , &INPUT1_TYP_CAL);
      EE_ReadVariable(VirtAddVarTab[2] , &INPUT1_MIN_CAL);
      EE_ReadVariable(VirtAddVarTab[3] , &INPUT1_MID_CAL);
      EE_ReadVariable(VirtAddVarTab[4] , &INPUT1_MAX_CAL);
      EE_ReadVariable(VirtAddVarTab[5] , &INPUT2_TYP_CAL);
      EE_ReadVariable(VirtAddVarTab[6] , &INPUT2_MIN_CAL);
      EE_ReadVariable(VirtAddVarTab[7] , &INPUT2_MID_CAL);
      EE_ReadVariable(VirtAddVarTab[8] , &INPUT2_MAX_CAL);
      EE_ReadVariable(VirtAddVarTab[9] , &i_max);
      EE_ReadVariable(VirtAddVarTab[10], &n_max);
      rtP_Left.i_max  = i_max;
      rtP_Left.n_max  = n_max;
    } else { // Else If Input type is 3 (auto), identify the input type based on the values from config.h
      if (INPUT1_TYPE == 3) { INPUT1_TYP_CAL = checkInputType(INPUT1_MIN, INPUT1_MID, INPUT1_MAX); }
      if (INPUT2_TYPE == 3) { INPUT2_TYP_CAL = checkInputType(INPUT2_MIN, INPUT2_MID, INPUT2_MAX); }
    }
    HAL_FLASH_Lock();
  #endif
#endif

}

/**
 * @brief  Disable Rx Errors detection interrupts on UART peripheral (since we do not want DMA to be stopped)
 *         The incorrect data will be filtered based on the START_FRAME and checksum.
 * @param  huart: UART handle.
 * @retval None
 */
void UART_DisableRxErrors(UART_HandleTypeDef *huart) {
	CLEAR_BIT(huart->Instance->CR1, USART_CR1_PEIE); /* Disable PE (Parity Error) interrupts */
	CLEAR_BIT(huart->Instance->CR3, USART_CR3_EIE); /* Disable EIE (Frame error, noise error, overrun error) interrupts */
}

/* =========================== General Functions =========================== */

void calcAvgSpeed(void) {
	// Calculate measured average speed. The minus sign (-) is because motors spin in opposite directions
	speedAvg = rtY_Left.n_mot;

	// Handle the case when SPEED_COEFFICIENT sign is negative (which is when most significant bit is 1)
	if (SPEED_COEFFICIENT & (1 << 16)) {
		speedAvg = -speedAvg;
	}
	speedAvgAbs = abs(speedAvg);
}

/*
 * Add Dead-band to a signal
 * This function realizes a dead-band around 0 and scales the input between [out_min, out_max]
 */
int addDeadBand(int16_t u, int16_t type, int16_t deadBand, int16_t in_min,
		int16_t in_mid, int16_t in_max, int16_t out_min, int16_t out_max) {
	switch (type) {
	case 0: // Input is ignored
		return 0;
	case 1: // Input is a normal pot
		return CLAMP(MAP(u, in_min, in_max, 0, out_max), 0, out_max);
	case 2: // Input is a mid resting pot
		if (u > in_mid - deadBand && u < in_mid + deadBand) {
			return 0;
		} else if (u > in_mid) {
			return CLAMP(MAP(u, in_mid + deadBand, in_max, 0, out_max), 0,
					out_max);
		} else {
			return CLAMP(MAP(u, in_mid - deadBand, in_min, 0, out_min), out_min,
					0);
		}
	default:
		return 0;
	}
}

/*
 * Update Maximum Motor Current Limit (via ADC1) and Maximum Speed Limit (via ADC2)
 * Procedure:
 * - press the power button for more than 5 sec and immediatelly after the beep sound press one more time shortly
 * - move and hold the pots to a desired limit position for Current and Speed
 * - press the power button to confirm or wait for the 10 sec timeout
 */
void updateCurSpdLim(void) {
#if KX
  if (speedAvgAbs > 5) {    // do not enter this mode if motors are spinning
    return;
  }

  #if !defined(VARIANT_HOVERBOARD) && !defined(VARIANT_TRANSPOTTER)
  consoleLog("Torque and Speed limits update started...\r\n");

  int32_t  input1_fixdt = input1 << 16;
  int32_t  input2_fixdt = input2 << 16;  
  uint16_t cur_factor;    // fixdt(0,16,16)
  uint16_t spd_factor;    // fixdt(0,16,16)
  uint16_t cur_spd_timeout = 0;
  cur_spd_valid = 0;

  // Wait for the power button press
  while (!HAL_GPIO_ReadPin(BUTTON_PORT, BUTTON_PIN) && cur_spd_timeout++ < 2000) {  // 10 sec timeout
    readInput();
    filtLowPass32(input1, FILTER, &input1_fixdt);
    filtLowPass32(input2, FILTER, &input2_fixdt);
    HAL_Delay(5);
  }
  // Calculate scaling factors
  cur_factor = CLAMP((input1_fixdt - ((int16_t)INPUT1_MIN_CAL << 16)) / ((int16_t)INPUT1_MAX_CAL - (int16_t)INPUT1_MIN_CAL), 6553, 65535);    // ADC1, MIN_cur(10%) = 1.5 A 
  spd_factor = CLAMP((input2_fixdt - ((int16_t)INPUT2_MIN_CAL << 16)) / ((int16_t)INPUT2_MAX_CAL - (int16_t)INPUT2_MIN_CAL), 3276, 65535);    // ADC2, MIN_spd(5%)  = 50 rpm
      
  if (INPUT1_TYP_CAL != 0){
    // Update current limit
    rtP_Left.i_max = rtP_Right.i_max  = (int16_t)((I_MOT_MAX * A2BIT_CONV * cur_factor) >> 12);    // fixdt(0,16,16) to fixdt(1,16,4)
    cur_spd_valid   = 1;  // Mark update to be saved in Flash at shutdown
  }

  if (INPUT2_TYP_CAL != 0){
    // Update speed limit
    rtP_Left.n_max = rtP_Right.n_max  = (int16_t)((N_MOT_MAX * spd_factor) >> 12);                 // fixdt(0,16,16) to fixdt(1,16,4)
    cur_spd_valid  += 2;  // Mark update to be saved in Flash at shutdown
  }
  
  consoleLog("Limits: "); HAL_Delay(10);
  setScopeChannel(0, (int16_t)cur_spd_valid);     // 0 = No limit changed, 1 = Current limit changed, 2 = Speed limit changed, 3 = Both limits changed
  setScopeChannel(1, (int16_t)input1_fixdt);
  setScopeChannel(2, (int16_t)cur_factor);
  setScopeChannel(3, (int16_t)rtP_Left.i_max);
  setScopeChannel(4, (int16_t)0);
  setScopeChannel(5, (int16_t)input2_fixdt);
  setScopeChannel(6, (int16_t)spd_factor);
  setScopeChannel(7, (int16_t)rtP_Left.n_max);
  consoleScope();

#endif
#endif
}

/*
 * Save Configuration to Flash
 * This function makes sure data is not lost after power-off
 */
void saveConfig() {
#ifdef VARIANT_TRANSPOTTER
    if (saveValue_valid) {
      HAL_FLASH_Unlock();
      EE_WriteVariable(VirtAddVarTab[0], saveValue);
      HAL_FLASH_Lock();
    }
  #endif
#if !defined(VARIANT_HOVERBOARD) && !defined(VARIANT_TRANSPOTTER)
	if (inp_cal_valid || cur_spd_valid) {
		HAL_FLASH_Unlock();
		EE_WriteVariable(VirtAddVarTab[0], FLASH_WRITE_KEY);
		EE_WriteVariable(VirtAddVarTab[1], INPUT1_TYP_CAL);
		EE_WriteVariable(VirtAddVarTab[2], INPUT1_MIN_CAL);
		EE_WriteVariable(VirtAddVarTab[3], INPUT1_MID_CAL);
		EE_WriteVariable(VirtAddVarTab[4], INPUT1_MAX_CAL);
		EE_WriteVariable(VirtAddVarTab[5], INPUT2_TYP_CAL);
		EE_WriteVariable(VirtAddVarTab[6], INPUT2_MIN_CAL);
		EE_WriteVariable(VirtAddVarTab[7], INPUT2_MID_CAL);
		EE_WriteVariable(VirtAddVarTab[8], INPUT2_MAX_CAL);
		EE_WriteVariable(VirtAddVarTab[9], rtP_Left.i_max);
		EE_WriteVariable(VirtAddVarTab[10], rtP_Left.n_max);
		HAL_FLASH_Lock();
	}
#endif
}

