maksidze/SmartESC_STM32_M365/Core/Src/util.c
/*
 * Function to read the raw Input values from various input devices
 */
void readInput(void) {

	input1 = command.steer;
	input2 = command.speed;
	timeoutCnt = 0;

}

/*
 * Function to calculate the command to the motors. This function also manages:
 * - timeout detection
 * - MIN/MAX limitations and deadband
 */
void readCommand(void) {
	readInput();

	if (timeoutCntSerial_R++ >= SERIAL_TIMEOUT) {     // Timeout qualification
		timeoutFlagSerial_R = 1;                        // Timeout detected
		timeoutCntSerial_R = SERIAL_TIMEOUT;       // Limit timout counter value
	}
	timeoutFlagSerial = timeoutFlagSerial_R;

#if KX
#if !defined(VARIANT_HOVERBOARD) && !defined(VARIANT_TRANSPOTTER)
  cmd1 = addDeadBand(input1, INPUT1_TYP_CAL, INPUT1_DEADBAND, INPUT1_MIN_CAL, INPUT1_MID_CAL, INPUT1_MAX_CAL, INPUT_MIN, INPUT_MAX);
  #if !defined(VARIANT_SKATEBOARD)
    cmd2 = addDeadBand(input2, INPUT2_TYP_CAL, INPUT2_DEADBAND, INPUT2_MIN_CAL, INPUT2_MID_CAL, INPUT2_MAX_CAL, INPUT_MIN, INPUT_MAX);
  #else
    cmd2 = addDeadBand(input2, INPUT2_TYP_CAL, INPUT2_DEADBAND, INPUT2_MIN_CAL, INPUT2_MID_CAL, INPUT2_MAX_CAL, INPUT2_BRAKE, INPUT_MAX);
  #endif
#endif
#else
	cmd1 = input1;
	cmd2 = input2;
#endif

	brakePressed = (uint8_t) (cmd1 > 50);

	if (timeoutFlagADC || timeoutFlagSerial || timeoutCnt > TIMEOUT) { // In case of timeout bring the system to a Safe State
		ctrlModReq = OPEN_MODE; // Request OPEN_MODE. This will bring the motor power to 0 in a controlled way
		cmd1 = 0;
		cmd2 = 0;
	} else {
		ctrlModReq = ctrlModReqRaw;                   // Follow the Mode request
	}

#if defined(CRUISE_CONTROL_SUPPORT) && (defined(SUPPORT_BUTTONS) || defined(SUPPORT_BUTTONS_LEFT) || defined(SUPPORT_BUTTONS_RIGHT))
      cruiseControl(button1);                                           // Cruise control activation/deactivation
    #endif    
}

/*
 * Check for new data received on USART3 with DMA: refactored function from https://github.com/MaJerle/stm32-usart-uart-dma-rx-tx
 * - this function is called for every USART IDLE line detection, in the USART interrupt handler
 */
void usart3_rx_check(void) {

	static uint32_t old_pos;
	uint32_t pos;
	pos = rx_buffer_R_len - __HAL_DMA_GET_COUNTER(huart3.hdmarx); // Calculate current position in buffer

	uint8_t *ptr;
	if (pos != old_pos) {                       // Check change in received data
		ptr = (uint8_t*) &command_raw; // Initialize the pointer with command_raw address
		if (pos > old_pos && (pos - old_pos) == command_len) { // "Linear" buffer mode: check if current position is over previous one AND data length equals expected length
			memcpy(ptr, &rx_buffer_R[old_pos], command_len); // Copy data. This is possible only if command_raw is contiguous! (meaning all the structure members have the same size)
			usart_process_command(&command_raw, &command, 3);    // Process data
		} else if ((rx_buffer_R_len - old_pos + pos) == command_len) { // "Overflow" buffer mode: check if data length equals expected length
			memcpy(ptr, &rx_buffer_R[old_pos], rx_buffer_R_len - old_pos); // First copy data from the end of buffer
			if (pos > 0) {        // Check and continue with beginning of buffer
				ptr += rx_buffer_R_len - old_pos; // Move to correct position in command_raw
				memcpy(ptr, &rx_buffer_R[0], pos);        // Copy remaining data
			}
			usart_process_command(&command_raw, &command, 3);    // Process data
		}
	}

	old_pos = pos;                                        // Update old position
	if (old_pos == rx_buffer_R_len) { // Check and manually update if we reached end of buffer
		old_pos = 0;
	}

}

/*
 * Process Rx debug user command input
 */
#if defined(DEBUG_SERIAL_USART2) || defined(DEBUG_SERIAL_USART3)
void usart_process_debug(uint8_t *userCommand, uint32_t len)
{
  for (; len > 0; len--, userCommand++) {
    if (*userCommand != '\n' && *userCommand != '\r') {   // Do not accept 'new line' and 'carriage return' commands
      consoleLog("-- Command received --\r\n");
      // handle_input(*userCommand);                      // -> Create this function to handle the user commands
    }
  }
}
#endif // SERIAL_DEBUG

/*
 * Process command Rx data
 * - if the command_in data is valid (correct START_FRAME and checksum) copy the command_in to command_out
 */
#if defined(CONTROL_SERIAL_USART2) || defined(CONTROL_SERIAL_USART3)
void usart_process_command(SerialCommand *command_in,
		SerialCommand *command_out, uint8_t usart_idx) {
#ifdef CONTROL_IBUS
    if (command_in->start == IBUS_LENGTH && command_in->type == IBUS_COMMAND) {
      ibus_chksum = 0xFFFF - IBUS_LENGTH - IBUS_COMMAND;
      for (uint8_t i = 0; i < (IBUS_NUM_CHANNELS * 2); i++) {
        ibus_chksum -= command_in->channels[i];
      }
      if (ibus_chksum == (uint16_t)((command_in->checksumh << 8) + command_in->checksuml)) {
        *command_out = *command_in;
        if (usart_idx == 2) {             // Sideboard USART2
          #ifdef CONTROL_SERIAL_USART2
          timeoutCntSerial_L  = 0;        // Reset timeout counter
          timeoutFlagSerial_L = 0;        // Clear timeout flag
          #endif
        } else if (usart_idx == 3) {      // Sideboard USART3
          #ifdef CONTROL_SERIAL_USART3
          timeoutCntSerial_R  = 0;        // Reset timeout counter
          timeoutFlagSerial_R = 0;        // Clear timeout flag
          #endif
        }
      }
    }
  #else
	uint16_t checksum;
	if (command_in->start == SERIAL_START_FRAME) {
		checksum = (uint16_t) (command_in->start ^ command_in->steer
				^ command_in->speed);
		if (command_in->checksum == checksum) {
			*command_out = *command_in;
			if (usart_idx == 2) {             // Sideboard USART2
#ifdef CONTROL_SERIAL_USART2
        timeoutCntSerial_L  = 0;        // Reset timeout counter
        timeoutFlagSerial_L = 0;        // Clear timeout flag
        #endif
			} else if (usart_idx == 3) {      // Sideboard USART3
#ifdef CONTROL_SERIAL_USART3
				timeoutCntSerial_R = 0;        // Reset timeout counter
				timeoutFlagSerial_R = 0;        // Clear timeout flag
#endif
			}
		}
	}
#endif
}
#endif

