maksidze/SmartESC_STM32_M365/Core/Src/util.c
/* Low pass filter fixed-point 32 bits: fixdt(1,32,16)
 * Max:  32767.99998474121
 * Min: -32768
 * Res:  1.52587890625e-05
 *
 * Inputs:       u     = int16 or int32
 * Outputs:      y     = fixdt(1,32,16)
 * Parameters:   coef  = fixdt(0,16,16) = [0,65535U]
 *
 * Example:
 * If coef = 0.8 (in floating point), then coef = 0.8 * 2^16 = 52429 (in fixed-point)
 * filtLowPass16(u, 52429, &y);
 * yint = (int16_t)(y >> 16); // the integer output is the fixed-point ouput shifted by 16 bits
 */
void filtLowPass32(int32_t u, uint16_t coef, int32_t *y) {
	int64_t tmp;
	tmp = ((int64_t) ((u << 4) - (*y >> 12)) * coef) >> 4;
	tmp = CLAMP(tmp, -2147483648LL, 2147483647LL); // Overflow protection: 2147483647LL = 2^31 - 1
	*y = (int32_t) tmp + (*y);
}
// Old filter
// Inputs:       u     = int16
// Outputs:      y     = fixdt(1,32,20)
// Parameters:   coef  = fixdt(0,16,16) = [0,65535U]
// yint = (int16_t)(y >> 20); // the integer output is the fixed-point ouput shifted by 20 bits
// void filtLowPass32(int16_t u, uint16_t coef, int32_t *y) {
//   int32_t tmp;
//   tmp = (int16_t)(u << 4) - (*y >> 16);
//   tmp = CLAMP(tmp, -32768, 32767);  // Overflow protection
//   *y  = coef * tmp + (*y);
// }

/* rateLimiter16(int16_t u, int16_t rate, int16_t *y);
 * Inputs:       u     = int16
 * Outputs:      y     = fixdt(1,16,4)
 * Parameters:   rate  = fixdt(1,16,4) = [0, 32767] Do NOT make rate negative (>32767)
 */
void rateLimiter16(int16_t u, int16_t rate, int16_t *y) {
	int16_t q0;
	int16_t q1;

	q0 = (u << 4) - *y;

	if (q0 > rate) {
		q0 = rate;
	} else {
		q1 = -rate;
		if (q0 < q1) {
			q0 = q1;
		}
	}

	*y = q0 + *y;
}

/* mixerFcn(rtu_speed, rtu_steer, &rty_speedR, &rty_speedL);
 * Inputs:       rtu_speed, rtu_steer                  = fixdt(1,16,4)
 * Outputs:      rty_speedL                            = int16_t
 * Parameters:   SPEED_COEFFICIENT, STEER_COEFFICIENT  = fixdt(0,16,14)
 */
void mixerFcn(int16_t rtu_speed, int16_t rtu_steer, int16_t *rty_speedL) {
	int16_t prodSpeed;
	int32_t tmp;

	prodSpeed = (int16_t) ((rtu_speed * (int16_t) SPEED_COEFFICIENT) >> 14);

	tmp = prodSpeed;
	tmp = CLAMP(tmp, -32768, 32767);  // Overflow protection
	*rty_speedL = (int16_t) (tmp >> 4);       // Convert from fixed-point to int
	*rty_speedL = CLAMP(*rty_speedL, INPUT_MIN, INPUT_MAX);
}

/* =========================== Multiple Tap Function =========================== */

/* multipleTapDet(int16_t u, uint32_t timeNow, MultipleTap *x)
 * This function detects multiple tap presses, such as double tapping, triple tapping, etc.
 * Inputs:       u = int16_t (input signal); timeNow = uint32_t (current time)
 * Outputs:      x->b_multipleTap (get the output here)
 */
void multipleTapDet(int16_t u, uint32_t timeNow, MultipleTap *x) {
	uint8_t b_timeout;
	uint8_t b_hyst;
	uint8_t b_pulse;
	uint8_t z_pulseCnt;
	uint8_t z_pulseCntRst;
	uint32_t t_time;

	// Detect hysteresis
	if (x->b_hysteresis) {
		b_hyst = (u > MULTIPLE_TAP_LO);
	} else {
		b_hyst = (u > MULTIPLE_TAP_HI);
	}

	// Detect pulse
	b_pulse = (b_hyst != x->b_hysteresis);

	// Save time when first pulse is detected
	if (b_hyst && b_pulse && (x->z_pulseCntPrev == 0)) {
		t_time = timeNow;
	} else {
		t_time = x->t_timePrev;
	}

	// Create timeout boolean
	b_timeout = (timeNow - t_time > MULTIPLE_TAP_TIMEOUT);

	// Create pulse counter
	if ((!b_hyst) && (x->z_pulseCntPrev == 0)) {
		z_pulseCnt = 0U;
	} else {
		z_pulseCnt = b_pulse;
	}

	// Reset counter if we detected complete tap presses OR there is a timeout
	if ((x->z_pulseCntPrev >= MULTIPLE_TAP_NR) || b_timeout) {
		z_pulseCntRst = 0U;
	} else {
		z_pulseCntRst = x->z_pulseCntPrev;
	}
	z_pulseCnt = z_pulseCnt + z_pulseCntRst;

	// Check if complete tap presses are detected AND no timeout
	if ((z_pulseCnt >= MULTIPLE_TAP_NR) && (!b_timeout)) {
		x->b_multipleTap = !x->b_multipleTap;	// Toggle output
	}

	// Update states
	x->z_pulseCntPrev = z_pulseCnt;
	x->b_hysteresis = b_hyst;
	x->t_timePrev = t_time;
}

